# Python test
by Grigory Sharkov

# 1. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
Sample Python dictionary data and list labels
```yml
exam_data: 
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
labels: ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

```
Expected Output:

| | attempts | name | qualify | score |
| --- | --- | --- | --- | --- |
| a | 1 | Anastasia | yes | 12.5 |
| b | 3 | Dima | no | 9.0 |
| ... | ... | ... | ... | ... |
| i | 2 | Kevin | no | 8.0 |
| j | 1 | Jonas | yes | 19.0 |

In [1]:
import pandas as pd
import numpy as np

In [26]:
pd.options.display.max_rows = 4
exam_data = {
    'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']
}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

COL_ORDER = ["attempts", "name", "qualify", "score"]

data = pd.DataFrame(exam_data, index=labels)
data[COL_ORDER]

    attempts       name qualify  score
a          1  Anastasia     yes   12.5
b          3       Dima      no    9.0
..       ...        ...     ...    ...
i          2      Kevin      no    8.0
j          1      Jonas     yes   19.0

[10 rows x 4 columns]

# 2. Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data

The same input as above.  
Expected output:
```
Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
...
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None 
```

In [12]:
print("Summary of the basic information about this DataFrame and its data:")
data.info()

Summary of the basic information about this DataFrame and its data:
<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

# 3. Write a Pandas program to select the specified columns and rows from a given data frame.

The same input. Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.  
Expected output:

| | name | score |
| --- | --- | --- |
| b | Dima | 9.0 |
| d | James | NaN |
| f | Michael | 20.0 |
| g | Matthew | 14.5 |

In [21]:
rows_to_select = [1,3,5,6]
data.iloc[rows_to_select, :2]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

# 4. Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

The same input.  
Expected output:  
Rows where score is missing:

| | attempts | name | qualify | score |
| --- | --- | --- | --- | --- |
| d | 3 | James | no | NaN |
| h | 1 | Laura | no | NaN |

In [27]:
print("Rows where score is missing:")
data.loc[data.score.isna(), COL_ORDER]

Rows where score is missing:

   attempts   name qualify  score
d         3  James      no    NaN
h         1  Laura      no    NaN

# 5. Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).
The same input.  
Expected output:  
Rows where score between 15 and 20 (inclusive):

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| c | 2 | Katherine | yes | 16.5 |
| f | 3 | Michael | yes | 20.0 |
| j | 1 | Jonas | yes | 19.0 |

In [28]:
print("Rows where score between 15 and 20 (inclusive):")
condition = ((data.score >= 15) & (data.score <= 20))
data.loc[condition, COL_ORDER]

Rows where score between 15 and 20 (inclusive):

   attempts       name qualify  score
c         2  Katherine     yes   16.5
f         3    Michael     yes   20.0
j         1      Jonas     yes   19.0

# 6. Write a Pandas program to calculate the sum of the examination attempts by the students.
The same input.  
Expected output:
```
Sum of the examination attempts by the students:
19 
```

In [32]:
print(f"Sum of the examination attempts by the students:\n{data.attempts.sum()}")

Sum of the examination attempts by the students:
19

# 7. Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.
The same input data as above  
Expected output:  
`Sort the data frame first by 'name' in descending order, then by 'score' in ascending order: `

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| a | 1 | Anastasia | yes | 12.5 | 
| b | 3 | Dima | no | 9.0
... 
| i | 2 | Kevin | no | 8.0 | 
| j | 1 | Jonas | yes | 19.0 |

In [46]:
print("Sort the data frame first by 'name' in descending order, then by 'score' in ascending order:")
data\
    .sort_values(by=['name', 'score'], ascending=[False, True])

Sort the data frame first by 'name' in descending order, then by 'score' in ascending order:

         name  score  attempts qualify
f     Michael   20.0         3     yes
g     Matthew   14.5         1     yes
..        ...    ...       ...     ...
b        Dima    9.0         3      no
a   Anastasia   12.5         1     yes

[10 rows x 4 columns]

# 7.1. Write a Pandas program to append a new row 'k' to DataFrame with given values for each column.
The same input data as above. Values for each column will be:  
`name : ‘Suresh’, score: 15.5, attempts: 1, qualify: ‘yes’, label: ‘k’`  
Expected output:  

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| a | 1 | Anastasia | yes | 12.5 | 
| b | 3 | Dima | no | 9.0
... 
| j | 1 | Jonas | yes | 19.0 | 
| k | 1 | Suresh | yes | 15.5 |

In [92]:
data.loc["k"] = ['Suresh',  15.5, 1, 'yes']
data[COL_ORDER]
data.drop("k", axis=0, inplace=True)

# 8. Write a Pandas program to get list from DataFrame column headers. 
The same input data as above  
Expected Output:  
`['attempts', 'name', 'qualify', 'score']`

In [54]:
list(data[COL_ORDER].columns)

['attempts', 'name', 'qualify', 'score']

# 9. Write a Pandas program to rename columns of a given DataFrame 
Sample data:

| | col1 | col2 | col3 |
| --- | ---| --- | --- |
| 0 | 1 | 4 | 7 | 
| 1 | 2 | 5 | 8 | 
| 2 | 3 | 6 | 9 |

New DataFrame after renaming columns:

| | Column1 | Column2 | Column3 |
| --- | ---| --- | --- |
| 0 | 1 | 4 | 7 | 
| 1 | 2 | 5 | 8 | 
| 2 | 3 | 6 | 9 |

In [61]:
sample = pd.DataFrame(
    data={
        "col1": range(1,4,1),
        "col2": range(4,7,1),
        "col3": range(7,10,1),
    }
)
print(f"Sample data:")
print(sample)
print("\nNew DataFrame after renaming columns:")
print(
    sample.rename(
        mapper={
            "col1": "Column1",
            "col2": "Column2",
            "col3": "Column3",
        },
        axis=1
    )
)

Sample data:
   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

New DataFrame after renaming columns:
   Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

# 10. Write a Pandas program to select rows from a given DataFrame based on values in some columns. 
Sample data:  
Original DataFrame

| | col1 | col2 | col3 |
| --- | ---| --- | --- |
| 0 | 1 | 4 | 7 |
| 1 | 4 | 5 | 8 |
| 2 | 3 | 6 | 9 |
| 3 | 4 | 7 | 0 |
| 4 | 5 | 8 | 1 |

Expected output:  

`Rows for colum1 value == 4`

| | col1 | col2 | col3 |
| --- | ---| --- | --- |
| 1 | 4 | 5 | 8 |
| 3 | 4 | 7 | 0 |

In [65]:
sample = pd.DataFrame(
    data={
        "col1": [1, 4, 3, 4, 5],
        "col2": range(4, 9, 1),
        "col_3": [7, 8, 9, 0, 1]
    }
)

print("Original dataframe:")
print(sample)
print("\nRows for column1 value==4:")
print(sample.loc[sample.col1==4])

Original dataframe:
    col1  col2  col_3
0      1     4      7
1      4     5      8
..   ...   ...    ...
3      4     7      0
4      5     8      1

[5 rows x 3 columns]

Rows for column1 value==4:
   col1  col2  col_3
1     4     5      8
3     4     7      0

# 11. Write a Pandas program to widen output display to see more columns. 
Input data, the same as above

In [75]:
pd.set_option("display.max_columns", 20)
print(f"Current number of columns to be displayed {pd.options.display.max_columns}")
pd.set_option("display.max_columns", pd.options.display.max_columns+1)
print(f"Updated number of columns to be displayed {pd.options.display.max_columns}")

Current number of columns to be displayed 20
Updated number of columns to be displayed 21

# 12. Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe. 
Sample data:

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| 0 | 1 | Anastasia | yes | 12.5 |
| 1 | 3 | Dima | no | 9.0 |
| 2 | 2 | Katherine | yes | 16.5 |
| 3 | 3 | James | no | NaN |
| 4 | 2 | Emily | no | 9.0 |
| 5 | 3 | Michael | yes | 20.0 |
| 6 | 1 | Matthew | yes | 14.5 |
| 7 | 1 | Laura | no | NaN |
| 8 | 2 | Kevin | no | 8.0 |
| 9 | 1 | Jonas | yes | 19.0 |

New DataFrame replacing all NaN with 0:

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| 0 | 1 | Anastasia | yes | 12.5 |
| 1 | 3 | Dima | no | 9.0 |
| 2 | 2 | Katherine | yes | 16.5 |
| 3 | 3 | James | no | 0.0 |
| 4 | 2 | Emily | no | 9.0 |
| 5 | 3 | Michael | yes | 20.0 |
| 6 | 1 | Matthew | yes | 14.5 |
| 7 | 1 | Laura | no | 0.0 |
| 8 | 2 | Kevin | no | 8.0 |
| 9 | 1 | Jonas | yes | 19.0 |

In [93]:
pd.set_option("display.max_rows", 12)
print("New DataFrame replacing all NaN with 0:")
data[COL_ORDER]\
    .fillna(0)\
    .reset_index(drop=True)

New DataFrame replacing all NaN with 0:

   attempts       name qualify  score
0         1  Anastasia     yes   12.5
1         3       Dima      no    9.0
2         2  Katherine     yes   16.5
3         3      James      no    0.0
4         2      Emily      no    9.0
5         3    Michael     yes   20.0
6         1    Matthew     yes   14.5
7         1      Laura      no    0.0
8         2      Kevin      no    8.0
9         1      Jonas     yes   19.0

# 13. Write a Pandas program to reset index in a given DataFrame. 
Input data: the same as above  
`After removing first and second rows`  

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| 2 | 2 | Katherine | yes | 16.5 |
| 3 | 3 | James | no | NaN |
| 4 | 2 | Emily | no | 9.0 |
| 5 | 3 | Michael | yes | 20.0 |
| 6 | 1 | Matthew | yes | 14.5 |
| 7 | 1 | Laura | no | NaN |
| 8 | 2 | Kevin | no | 8.0 |
| 9 | 1 | Jonas | yes | 19.0 |

`Reset the Index:`

| | index | attempts | name | qualify | score |
| --- | --- | ---| --- | --- | --- |
| 0 | 2 | 2 | Katherine | yes | 16.5 |
| 1 | 3 | 3 | James | no | NaN |
| 2 | 4 | 2 | Emily | no | 9.0 |
| 3 | 5 | 3 | Michael | yes | 20.0 |
| 4 | 6 | 1 | Matthew | yes | 14.5 |
| 5 | 7 | 1 | Laura | no | NaN |
| 6 | 8 | 2 | Kevin | no | 8.0 |
| 7 | 9 | 1 | Jonas | yes | 19.0 |

In [94]:
data_copy = data.copy(deep=True).reset_index(drop=True).drop([0,1], axis=0)
print("After removing the first and the sencond rows:")
print(data_copy[COL_ORDER])
print("\nReset the Index:")
print(data_copy[COL_ORDER].reset_index())

After removing the first and the sencond rows:
  attempts       name qualify score
2        2  Katherine     yes  16.5
3        3      James      no   NaN
4        2      Emily      no   9.0
5        3    Michael     yes  20.0
6        1    Matthew     yes  14.5
7        1      Laura      no   NaN
8        2      Kevin      no   8.0
9        1      Jonas     yes  19.0

Reset the Index:
   index attempts       name qualify score
0      2        2  Katherine     yes  16.5
1      3        3      James      no   NaN
2      4        2      Emily      no   9.0
3      5        3    Michael     yes  20.0
4      6        1    Matthew     yes  14.5
5      7        1      Laura      no   NaN
6      8        2      Kevin      no   8.0
7      9        1      Jonas     yes  19.0

# 14. Write a Pandas program to devide a DataFrame in a given ratio.
Input data:  

| | 0 | 1 |
| --- | --- | --- |
| 0 | 0.316147 | -0.767359 |
| 1 | -0.813410 | -2.522672 |
| 2 | 0.869615 | 1.194704 |
| 3 | -0.892915 | -0.055133 |
| 4 | -0.341126 | 0.518266 |
| 5 | 1.857342 | 1.361229 |
| 6 | -0.044353 | -1.205002 |
| 7 | -0.726346 | -0.535147 |
| 8 | -1.350726 | 0.563117 |
| 9 | 1.051666 | -0.441533 |

70% of the said DataFrame:

| | 0 | 1 |
| --- | --- | --- |
| 0 | 0.316147 | -0.767359 |
| 2 | 0.869615 | 1.194704 |
| 3 | -0.892915 | -0.055133 |
| 4 | -0.341126 | 0.518266 |
| 6 | -0.044353 | -1.205002 |
| 7 | -0.726346 | -0.535147 |
| 9 | 1.051666 | -0.441533 |

30% of the said DataFrame:

| | 0 | 1 |
| --- | --- | --- |
| 1 | -0.813410 | -2.522672 |
| 5 | 1.857342 | 1.361229 |
| 8 | -1.350726 | 0.563117 |

### 3 notes concerning the code:
* Since the data generation and the data split do not have any seeds reported, the results are not completely the same: the input data is different, but the ratios are respected
* Since the task is to write a "Pandas" program, I was not using any sklearn features and was trying to use as much of pandas functionality as possible
* I am not using `pd.DataFrame.sample` method since generaly operations with index are much faster

In [119]:
np.random.seed(20230301)
random_data = pd.DataFrame(
    data={
        0: np.random.normal(0, 2, 10),
        1: np.random.normal(0, 2, 10),
    }
)

FRAC = .7
train_index = pd.Series(random_data.index)\
    .sample(frac=FRAC, random_state=20230301)\
    .to_list()

print(f"{FRAC*100:.0f}% of the said DataFrame:")
print(random_data.loc[train_index, :])

print(f"\n{(1-FRAC)*100:.0f}% of the said DataFrame:")
print(random_data.loc[random_data.index.difference(train_index), :])

70% of the said DataFrame:
          0         1
1 -0.873072  2.682445
0 -3.861730  3.166442
3 -0.054671  2.065020
6  2.002476  0.813416
5  1.233205  0.219757
8  2.016034  3.242648
2 -1.282255  0.279113

30% of the said DataFrame:
          0         1
4 -0.686856 -0.108471
7  3.429203  1.551042
9  3.866956 -2.274437

# 15. Write a Pandas program to convert DataFrame column type from string to datetime.

Sample data:

| | string_date | 
| --- | --- | 
| 0 | 3/11/2000 | 
| 1 | 3/12/2000 | 
| 2 | 3/13/2000 | 

`dtype: object`

Original DataFrame (string to datetime):

| | converted_date |
| --- | --- | 
| 0 | 2000-03-11 |
| 1 | 2000-03-12 |
| 2 | 2000-03-13 |

In [128]:
string_series = pd.Series(["3/11/2000", "3/12/2000", "3/13/2000"])
print("Sample data:")
print(string_series)

print("\nDatetime series:")
print(pd.to_datetime(string_series).dt.date)

Sample data:
0    3/11/2000
1    3/12/2000
2    3/13/2000
dtype: object

Datetime series:
0    2000-03-11
1    2000-03-12
2    2000-03-13
dtype: object

# 16. Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers. 
Sample Output:

| |  Column1 | Column2 | Column3 |
| --- | --- | --- | --- |
| Index1 | 0.0 | 0.0 | 0.0 |
| Index2 | 0.0 | 0.0 | 0.0 |
| Index3 | 0.0 | 0.0 | 0.0 |
...
| Index13 | 0.0 | 0.0 | 0.0 |
| Index14 | 0.0 | 0.0 | 0.0 |
| Index15 | 0.0 | 0.0 | 0.0 |

In [132]:
pd.set_option("display.max_rows", 6)
N_ROWS = 15
N_COLS = 3
numpy_data = np.zeros(shape=(N_ROWS,N_COLS))
pd.DataFrame(
    data=numpy_data,
    index=[f"Index{i+1}" for i in range(N_ROWS)],
    columns=[f"Column{i+1}" for i in range(N_COLS)],
)

         Column1  Column2  Column3
Index1       0.0      0.0      0.0
Index2       0.0      0.0      0.0
Index3       0.0      0.0      0.0
...          ...      ...      ...
Index13      0.0      0.0      0.0
Index14      0.0      0.0      0.0
Index15      0.0      0.0      0.0

[15 rows x 3 columns]

# 17. Write a Pandas program to find the row for where the value of a given column is maximum. 
Input data:
```yaml
col1: [1, 2, 3, 4, 7]
col2: [4, 5, 6, 9, 5]
col3: [7, 8, 12, 1, 11]
```
  
Sample output:  
```
Row where col1 has maximum value: 4
Row where col2 has maximum value: 3
Row where col3 has maximum value: 2
```

In [138]:
max_data = pd.DataFrame(
    data={
        "col1": [1, 2, 3, 4, 7],
        "col2": [4, 5, 6, 9, 5],
        "col3": [7, 8, 12, 1, 11],
    }
)

for col in max_data.columns:
    max_index = list(max_data[max_data[col] == max_data[col].max()].index)[0]
    print(f"Row where {col} has maximum value: {max_index}")

Row where col1 has maximum value: 4
Row where col2 has maximum value: 3
Row where col3 has maximum value: 2

# 18. Write a Pandas program to convert the datatype of a given column (floats to ints).
Input data:

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| 0 | 1 | Anastasia | yes | 12.5 |
| 1 | 3 | Dima | no | 9.0 |
| 2 | 2 | Katherine | yes | 16.5 |
| 3 | 3 | James | no | NaN |
| 4 | 2 | Emily | no | 9.0 |
| 5 | 3 | Michael | yes | 20.0 |
| 6 | 1 | Matthew | yes | 14.5 |
| 7 | 1 | Laura | no | NaN |
| 8 | 2 | Kevin | no | 8.0 |
| 9 | 1 | Jonas | yes | 19.0 |

```
Data types of the columns of the said DataFrame:
attempts int64
name object
qualify object
score float64
dtype: object
```

Now change the Data type of 'score' column from float to int:

| | attempts | name | qualify | score |
| --- | ---| --- | --- | --- |
| 0 | 1 | Anastasia | yes | 12 |
| 1 | 3 | Dima | no | 9 |
| 2 | 2 | Katherine | yes | 16 |
| 3 | 3 | James | no | NaN |
| 4 | 2 | Emily | no | 9 |
| 5 | 3 | Michael | yes | 20 |
| 6 | 1 | Matthew | yes | 14 |
| 7 | 1 | Laura | no | NaN |
| 8 | 2 | Kevin | no | 8 |
| 9 | 1 | Jonas | yes | 19 |

```
Data types of the columns of the DataFrame now:
attempts int64
name object
qualify object
score int64
dtype: object
```


### My remarks
since `None` or `np.NaN` values are float in python we cannot just ignore them when casting column type. Therefore we need to replace them with an integer before trying the convertion.

In [154]:
converted_data = data.copy(deep=True)[COL_ORDER]
print(f"Data types of the columns of the said DataFrame:\n{converted_data.dtypes}")

converted_data.score = converted_data.score.fillna(0).astype(np.int64)
print(f"\nData types of the columns of the DataFrame now:\n{converted_data.dtypes}")

Data types of the columns of the said DataFrame:
attempts    object
name        object
qualify     object
score       object
dtype: object

Data types of the columns of the DataFrame now:
attempts    object
name        object
qualify     object
score        int64
dtype: object

# 19. Write a Pandas program to convert a given list of lists into a Dataframe. 
Sample data:  
Original list of lists:  
`[[2, 4], [1, 3]]`

New DataFrame

| | col1 | col2 |
| --- | --- | --- |
| 0 | 2 | 4 |
| 1 | 1 | 3 |

In [155]:
list_data = [[2, 4], [1, 3]]
list_dataframe = pd.DataFrame(
    data = list_data,
    columns = ["col1", "col2"]
)
list_dataframe

   col1  col2
0     2     4
1     1     3

# 20. Write a Pandas program to group by the first column and get second column as lists in rows. 
Sample data:  
Original DataFrame

| | col1 | col2 |
|---|---|---|
| 0 | C1 | 1 |
| 1 | C1 | 2 |
| 2 | C2 | 3 |
| 3 | C2 | 3 |
| 4 | C2 | 4 |
| 5 | C3 | 6 |
| 6 | C2 | 5 |

Group on the col1:

| |col1|
|---|---|
|C1 |[1, 2]|
|C2 |[3, 3, 4, 5]|
|C3 |[6]|

Name: col2, dtype: object

In [163]:
pd.set_option("display.max_rows", 7)
group_data = pd.DataFrame(
    data={
        "col1": [f"C{x}" for x in [1, 1, 2, 2, 2, 3, 2]],
        "col2": [1, 2, 3, 3, 4, 6, 5]
    }
)

print("Original DataFrame:")
print(group_data)

print("\nGroup on the col1:")
print(
    group_data\
        .groupby("col1")["col2"]\
        .apply(list)
)

Original DataFrame:
  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

Group on the col1:
col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object